Revit 2026 API

# SlabShapeEditorModifySubElement(SlabShapeCrease, Double) Method

---

Manipulates the crease on the corresponding slab, roof or floor.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ModifySubElement(
	SlabShapeCrease crease,
	double offset
)
```
```vb
Public Sub ModifySubElement (
	crease As SlabShapeCrease,
	offset As Double
)
```
```cpp
public:
void ModifySubElement(
	SlabShapeCrease^ crease,
	double offset
)
```
```fsharp
member ModifySubElement :
        crease : SlabShapeCrease *
        offset : float -> unit
```

#### Parameters

crease SlabShapeCrease
    The crease.
offset Double
    The new value of the crease offset, which is the average of offsets of its ends.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the crease is . |
| ArgumentException | Thrown when the crease is invalid. |

#### Reference

SlabShapeEditor Class

ModifySubElement Overload

Autodesk.Revit.DB Namespace